L1/Others/BootWithRails/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("label", "bought", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["label", "salade"], ["bought", 0], ["created_at", "2021-06-01 07:44:51.296637"], ["updated_at", "2021-06-01 07:44:51.296637"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "label" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["label", "salade"], ["updated_at", "2021-06-01 07:54:18.288964"], ["id", 4]]